# Analyzing CIA Factbook Data Using SQL

**Objective**  
*Finding Answer to the questions:-*  
* Which countries are with below average area and above average population?  
* What country has the most people?  
* What country has the highest growth rate?  
* Which countries have the highest ratios of water to land?  
* Which countries have more water than land?  
* Which countries will add the most people to their population next year?

In [2]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [3]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [4]:
%%sql
SELECT *
  FROM facts
 LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

**Data Dictionary**
name - The name of the country.  
area- The country's total area (both land and water).  
area_land - The country's land area in square kilometers.  
area_water - The country's waterarea in square kilometers.  
population - The country's population.  
population_growth- The country's population growth as a percentage.  
birth_rate - The country's birth rate, or the number of births a year per 1,000 people.  
death_rate - The country's death rate, or the number of death a year per 1,000 people.

In [7]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
  FROM facts;

Done.

[(0, 7256490011, 0.0, 4.02)]

In [13]:
%%sql
SELECT name AS 'Country Name'
  FROM facts
 WHERE population = (SELECT MIN(population)
                       FROM facts
                    );

Done.

[('Antarctica',)]

In [12]:
%%sql
SELECT name AS 'Country Name'
  FROM facts
 WHERE population = (SELECT MAX(population)
                       FROM facts
                    );

Done.

[('World',)]

In [14]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
  FROM facts
 WHERE name NOT IN ('Antarctica', 'World');

Done.

[(48, 1367485388, 0.0, 4.02)]

In [15]:
%%sql
SELECT AVG(population), AVG(area)
  FROM facts;

Done.

[(62094928.32231405, 555093.546184739)]

In [19]:
%%sql
SELECT name
  FROM facts
 WHERE population > (SELECT AVG(population)
                       FROM facts
                    )
   AND area < (SELECT AVG(area)
                 FROM facts
              );

Done.

[('Bangladesh',),
 ('Germany',),
 ('Japan',),
 ('Philippines',),
 ('Thailand',),
 ('United Kingdom',),
 ('Vietnam',)]

**These are the countries with below average area and above average population.**

In [22]:
%%sql
SELECT name
  FROM facts
 WHERE population = (SELECT MAX(population)
                      FROM facts
                      WHERE name != 'World'
                    );

Done.

[('China',)]

In [24]:
%%sql
SELECT name
  FROM facts
 WHERE population_growth = (SELECT MAX(population_growth)
                      FROM facts
                      WHERE name != 'World'
                    );

Done.

[('South Sudan',)]

* **China is the country with the highest population**
* **South Sudan is the country with highest growth rate**

In [28]:
%%sql
SELECT name, MAX(CAST(area_water AS FLOAT) / CAST(area_land AS FLOAT)) AS 'Max Water to Land Ratio'
  FROM facts;

Done.

[('British Indian Ocean Territory', 905.6666666666666)]

In [30]:
%%sql
SELECT name
  FROM facts
 WHERE area_water > area_land;

Done.

[('British Indian Ocean Territory',), ('Virgin Islands',)]

* **British Indian Ocean Territory has the highest water to land ratio.**
* **British Indian Ocean Territory and Virgin Islands are the places which has more water area than land area.**

In [31]:
%%sql
SELECT name
  FROM facts
 WHERE population > (SELECT AVG(population)
                      FROM facts
                    )
   AND population_growth > (SELECT AVG(population_growth)
                             FROM facts
                           );

Done.

[('Bangladesh',),
 ('Congo, Democratic Republic of the',),
 ('Egypt',),
 ('Ethiopia',),
 ('India',),
 ('Nigeria',),
 ('Pakistan',),
 ('Philippines',),
 ('Turkey',)]

**These countries will add the most people to their population next year**